diary/20241018-1753.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="UTF-8">
<link rel="alternate"
      type="application/rss+xml"
      href="https://www.p-snow.org/config/diary/rss.xml"
      title="RSS feed for https://www.p-snow.org/config/diary">
<title>ミニバッファのフォントサイズを小さくする</title>
<meta charset="utf-8"><meta http-equiv="X-UA-Compatible" content="IE=edge"><meta name="viewport" content="width=device-width, initial-scale=1.0"><link rel="stylesheet" href="https://cdn.simplecss.org/simple.css"><link rel="stylesheet" href="./assets/css/style.css"></head>
<body>
<div id="preamble" class="status"><header><nav><a href="https://www.p-snow.org/config/diary">ホーム</a><a href="https://www.p-snow.org/config/diary/about.html">あばうと</a><a href="https://www.p-snow.org/config/diary/rss.xml">RSS</a></nav><h1>ティンカラー日記</h1><p>こなゆき(a.k.a. p-snow)</p></header></div>
<div id="content">
<div class="post-date">18 Oct 2024</div><h1 class="post-title"><a href="https://www.p-snow.org/config/diary/20241018-1753.html">ミニバッファのフォントサイズを小さくする</a></h1>
<p>
<preview>
Prot こと Protesilaos Stavrou 氏(相変わらず発音できない…)が彼のEmacsパッケージ fontaine のユーザからの質問「ミニバッファのフォントサイズを変えるにはどうしたらいいか」への答えを載せていた。
</p>

<p>
<a href="https://protesilaos.com/codelog/2024-10-17-emacs-remap-minibuffer-face/">Emacs: remap font size in the minibuffer | Protesilaos Stavrou</a>
</preview>
</p>

<p>
なるほど、と思いながら読み進めるうちに、そう言えば自分も昔、同じような設定をしたなと調べてみたら<a href="https://p-snow.org/config/dotfiles.html#emacs-minibuffer">あった</a>。
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">(<span style="font-weight: bold;">setq-local</span> face-remapping-alist '((default <span style="font-weight: bold;">:height</span> 0.9)))
</pre>
</div>

<p>
Protは face-remap の関数 face-remap-add-relative を使っていたのに対し、自分はCの変数 face-remapping-alist を直接 setq-local で弄っていた。コードを追っていくと何のことはない face-remap-add-relative 内で face-remapping-alist を設定していた。こりゃ Prot のコードの方が行儀がよいですな。
</p>
<div class="taglist"><a href="https://www.p-snow.org/config/diary/tags.html">Tags</a>: <a href="https://www.p-snow.org/config/diary/tag-org.html">org</a> <a href="https://www.p-snow.org/config/diary/tag-minibuffer.html">minibuffer</a> </div></div>
<div id="postamble" class="status"></div>
</body>
</html>
